use Restaurant;
-- 删除已存在的表
drop table if exists optionalfood;

create table optionalfood(
id int primary key auto_increment,
cname varchar(30) not null,
cprice float not null,
points int not null comment "积分",
ingredients varchar(50) null comment "食材",
taste varchar(50) null comment "口味",
type varchar(50) not null comment "种类",
stock int not null comment "库存",
mealmeans varchar(200) not null,
images Text not null
)comment "自选订餐信息表";

insert into optionalfood(cname,cprice,points,ingredients,taste,type,stock,mealmeans,images) 
values("滑溜肉片",6.00,6,'猪肉','可口','单点餐品',16,'自选订餐',"images/1253519609.jpg"),
('农家小炒肉',6.00,6,'猪肉,香芹','中辣','单点餐品',21,'自选订餐',"images/1253519531.jpg"),
('碧绿榨菜',6.00,6,'猪肉,香芹','清淡','单点餐品',50,'自选订餐',"images/1257398155.jpg"),
('醋椒牛柳',8.00,8,'牛柳','酸辣','单点餐品',29,'自选订餐',"images/1257397349.jpg"),
('鸡尾虾',12.00,12,'鲜活青虾','咸鲜味辣','单点餐品',30,'自选订餐',"images/1257397027.jpg"),
('梅菜扣肉',15.00,15,'梅菜，猪肉','微甜','单点餐品',30,'自选订餐',"images/1256607214.jpg"),
('腊肉蒸娃娃菜',16.00,16,'腊肉 娃娃菜','咸鲜微辣','单点餐品',30,'自选订餐',"images/1257396864.jpg"),
('辣香蛏子',18.00,18,'蛏子','香辣','单点餐品',20,'自选订餐',"images/1257396792.jpg"),
('大蒜鲶鱼',28.00,28,'鲶鱼','蒜香','单点餐品',15,'自选订餐',"images/1257397703.jpg"),
('美容香辣蹄',28.00,28,'猪蹄','香辣','单点餐品',20,'自选订餐',"images/1257396703.jpg"),
('水煮鱼',32.00,32,'草鱼','麻辣','单点餐品',10,'自选订餐',"images/1257396058.jpg"),
('福寿螺',34.00,34,'田螺','麻辣','单点餐品',10,'自选订餐',"images/1257396517.jpg"),
('飘香肥牛',50.00,50,'肥牛','藤椒','单点餐品',10,'自选订餐',"images/1257835997.jpg"),
('麻辣馋嘴蛙',52.00,52,'牛蛙','麻辣','单点餐品',10,'自选订餐',"images/1257395866.jpg"),
('稻香米饭',1.00,1,'优质大米','劲道','营养主食',80,'自选订餐',"images/1253598423.jpg"),
('绿豆饭',2.00,2,'大米,绿豆','香甜可口','营养主食',100,'自选订餐',"images/1257399645.jpg"),
('小米粥',2.00,2,'小米','软糯可口','营养主食',50,'自选订餐',"images/1267583447315.jpg@196w_126h_99q_1e_1c.jpg"),
('蔬菜粥',3.00,3,'大米,蔬菜','清淡养胃','营养主食',60,'自选订餐',"images/1337331743285.jpg@196w_126h_99q_1e_1c.jpg"),
('八宝粥',3.00,3,'八种豆','香甜可口','营养主食',30,'自选订餐',"images/1274425719838.jpg@196w_126h_99q_1e_1c.jpg"),
('胡萝卜瘦肉粥',4.00,4,'大米,胡萝卜,瘦肉','香甜软糯','营养主食',30,'自选订餐',"images/1269479126864.jpg@196w_126h_99q_1e_1c.jpg"),
('营养面',5.00,5,'面条,黄豆','劲道','营养主食',80,'自选订餐',"images/1257399334.jpg"),
('手工水饺',12.00,12,'面粉,猪肉','劲道','营养主食',80,'自选订餐',"images/u=3600964246,128041457&fm=27&gp=0.jpg"),
('拔丝香蕉',8.00,8,'香蕉,淀粉','甜食','点心小吃',80,'自选订餐',"images/1252377522.jpg"),
('鸡蛋三明治',4.00,4,'鸡蛋,面包','香甜','点心小吃',50,'自选订餐',"images/1257400599.jpg"),
('紫菜蛋花汤',3.00,3,'紫菜,蛋花','清淡','美味汤品',80,'自选订餐',"images/1253598893.jpg"),
('冬瓜丸子汤',5.00,5,'冬瓜,猪肉丸','清淡','美味汤品',50,'自选订餐',"images/1430986422208.jpg@196w_126h_99q_1e_1c.jpg"),
('冬瓜花甲汤',7.00,7,'冬瓜,花甲','清淡','美味汤品',80,'自选订餐',"images/1269461003723.jpg@196w_126h_99q_1e_1c.jpg"),
('酸萝卜老鸭汤',10.00,10,'萝卜,老鸭','酸辣','美味汤品',40,'自选订餐',"images/1257397522.jpg"),
('平菇鱼头豆腐汤',11.00,11,'平菇,鱼头,豆腐','清淡','美味汤品',30,'自选订餐',"images/1442804228333.jpg@196w_126h_99q_1e_1c.jpg"),
('钵钵鱼',12.00,12,'新鲜淡水鱼','辣','美味汤品',25,'自选订餐',"images/1257397207.jpg"),
('百事可乐',3.00,3,'可乐','碳酸汽水','酒水饮料',100,'自选订餐',"images/1253598975.jpg"),
('康师傅红茶',3.00,3,'红茶','柠檬味茶饮料','酒水饮料',100,'自选订餐',"images/1253599018.jpg"),
('雪花啤酒',5.00,5,'啤酒','碳酸酒水','酒水饮料',100,'自选订餐',"images/u=2016851633,332967069&fm=27&gp=0.jpg"),
('猕猴桃',5.00,5,'','','新鲜水果',100,'自选订餐',"images/1257401124.jpg"),
('香蕉',3.00,3,'','','新鲜水果',100,'自选订餐',"images/1257401238.jpg"),
('芒果',3.00,3,'','','新鲜水果',100,'自选订餐',"images/20191192129.jpg.jpg"),
('火龙果',3.00,3,'','','新鲜水果',100,'自选订餐',"images/20191192131.jpg");









